from configparser import ConfigParser

config = ConfigParser()
config.read('bot/config/config.ini')
channelInvite = config.get('urls', 'channelInvite')

class descriptions:
    def __init__(self):
        self.selectMenuItem = 'حدد عنصر القائمة 📋'
        self.maxClicksToday = 'الحد الأقصى المستخرج اليوم'
        self.withdrawCash = 'سحب المال'
        self.successfulLevelUp = 'لقد وصلت إلى مستوى أعلى'
        self.connectWithSponsor = f'تصل بالراعي الخاص بك للانتقال إلى المستوى التالي. {channelInvite}'
        self.followLink = 'اتبع الرابط 📲'
        self.toEarnGiftFollowSponsorChannel = """
        ❗️هل تريد 1200 EGP للاشتراك في القناة؟!❗️

👉 اشترك في القناة، ثم عد إلى هنا وانقر على "احصل على المكافأة". سوف تتلقى 1200 EGP.
        """
        self.printNumberOr0ToCancel = 'أدخل رقمًا صالحًا أو 0 للإلغاء'
        self.printEGPCount = 'أدخل رقم EGP للدفع'
        self.notEnoughHashToTrade = 'لا يوجد ما يكفي من التجزئة للتبادل'
        self.notEnoughEGP = 'لا يوجد ما يكفي من EGP للسحب'
        self.chooseBank = 'حدد البنك'
        self.bankNotFound = 'لا يوجد مثل هذا البنك'
        self.EGPReceivingNotAvailable = 'سحب EGP متاح فقط من مستوى التعدين 3'
        self.faq = """
١. ما هو هذا البوت؟ باستخدام هذا البوت على Telegram، يمكنك كسب EGP
2. كيف يعمل؟ كل نقرة تحصل على قوة معينة على خوادمنا، مما يسمح لك بتعدين العملات المشفرة
3. كيف تبدأ في الكسب؟ اختر عنصر القائمة كسب الهاش 💰 واضغط ابدأ التعدين ⛏️ لبدء الكسب. لكل نقرة ستحصل على كمية معينة من hash، والتي يمكنك استبدالها بـ EGP وسحبها
4. كيف تستبدل hash بـ EGP؟ اضغط على زر تبادل الهاش المكتسب 🔄، ثم أدخل كمية EGP
5. كيف تسحب الأموال؟ السحب متاح من المستوى 3 للتعدين. لسحب الأموال، يجب عليك اختيار عنصر القائمة الحصول على الدفع 💵
6. لماذا يجب رفع المستوى؟ كل مستوى يزيد من كمية hash التي يتم تعدينها لكل نقرة. لرفع المستوى، تحتاج إلى جمع كمية معينة من hash
7. كيف تكسب أكثر؟ للكسب، قمنا بإدخال نظام الإحالة والمهام من الرعاة
8. كيف تكسب في نظام الإحالة؟ من عنصر القائمة، تحتاج إلى الحصول على رابط الإحالة وإرساله إلى أصدقائك للتسجيل
9. كم من الوقت يستغرق الدفع؟ حوالي 3-7 أيام عمل
10. ما هي مهام الراعي؟ لكي نتمكن من الدفع للجميع على بوتنا، نقوم بالإعلان عن أشخاص وشركات مختلفة. لاستخدام إعلاناتنا بنشاط، ندفع لك أيضًا مقابل ذلك. انتقل إلى القائمة 💸 بمال أكثر وتعرف على القواعد المتعلقة بطلبات الراعي
11. من أين نحصل على الأموال لدفع المستخدمين؟ اليوم، العملات المشفرة تجلب أموالاً ضخمة. لهذا السبب ابتكرنا هذه الطريقة لتعدين العملات المشفرة، حتى يحصل جميع المشاركين على أرباح. بالإضافة إلى ذلك، نقدم إعلانات لمدونين وشركات مختلفة مرتبطة ارتباطًا وثيقًا بالعملات المشفرة.
"""
        self.printPromo = 'أدخل الرمز الترويجي'
        self.wrongPromo = 'رمز ترويجي غير صالح'
        self.commandUnknown = 'فريق غير معروف. اكتب /start'
        self.notSubscribed = '❌ أنت غير مشترك في هذه القناة ❌'
        self.giftSend = 'تمت إضافة 1200 EGP بنجاح إلى ملفك الشخصي'
        self.bonusAlreadyClaimed = 'لقد تم استلام المكافأة بالفعل'