class menus:
    def __init__(self):
        self.earn = 'كسب التجزئة 💰'
        self.earnMore = 'كسب المزيد/طرح سؤال ❓'
        self.referral = 'دعوة الأصدقاء 🧑‍🤝‍🧑'
        self.coinTrade = 'تبادل الهاش المكتسب 🔄'
        self.userLadder = 'أفضل المستخدمين 🏆'
        self.profile = 'ملفي الشخصي 🧍'
        self.payments = 'الحصول على الدفع 💵'
        self.faq = 'الأسئلة الشائعة 📚'
        self.promo = 'إدخال رمز الترويج 🎟️'
        self.mine = 'ابدأ التعدين ⛏️'
        self.levelUp = 'رفع مستوى التعدين 📈'
        self.mainMenu = 'إلى القائمة الرئيسية 🏠'

